from .. import Provider as LoremProvider


class Provider(LoremProvider):
    """Implement lorem provider for ``ko_KR`` locale."""

    word_connector = ''
    sentence_punctuation = '.'
    word_list = tuple('''
이상, 그들은 뜨거운지라, 말이다. 이는 속에 무한한 피가 있으며, 어디 평화스러운 두기 황금시대다. 그러므로 것이다.보라, 생의 자신과 피어나기 것이다. 인간의 따뜻한 따뜻한 그러므로 충분히 인생에 있는 청춘에서만 앞이 사막이다. 그것은 그들은 얼마나 철환하였는가? 무엇을 동력은 청춘에서만 얼음에 기쁘며, 같이, 되려니와, 봄바람이다. 전인 가치를 싸인 착목한는 청춘에서만 끓는 말이다. 하는 얼음 만물은 아름다우냐? 하는 있을 때에, 사랑의 투명하되 것은 아름다우냐? 품에 들어 능히 천하를 방황하여도, 봄바람이다. 그들의 공자는 돋고, 무엇을 가치를 것이다.

사랑의 그들은 인류의 황금시대다. 꾸며 꽃 그들에게 인생을 싸인 천지는 못할 동력은 봄바람이다. 옷을 가치를 보내는 때문이다. 인간의 그들의 그들의 용기가 같이, 꽃 풍부하게 봄바람을 뿐이다. 때까지 미묘한 더운지라 충분히 가장 가는 그들의 사막이다. 풍부하게 심장의 오직 인류의 밥을 못할 맺어, 우는 하는 끓는다. 청춘은 지혜는 끓는 이상은 피다. 노래하며 어디 무엇을 내는 사막이다. 사랑의 이상을 방지하는 황금시대를 천지는 수 투명하되 뼈 피가 사막이다.

아니한 들어 안고, 피가 같지 너의 심장의 창공에 구하지 그리하였는가? 품에 지혜는 바이며, 살았으며, 천고에 열락의 같지 있는 것이다. 살 위하여, 속에서 창공에 수 부패뿐이다. 수 봄바람을 가치를 이것이다. 만천하의 방황하였으며, 품으며, 끓는 것이다. 스며들어 원질이 이 가치를 끓는 있으랴? 품으며, 아니한 우리의 피가 것이다. 옷을 무엇을 시들어 힘있다. 얼음이 가치를 유소년에게서 끝까지 힘차게 대고, 얼마나 얼마나 그들의 때문이다. 무엇이 그들의 꾸며 가장 가슴에 것이다. 청춘의 그들은 거선의 곳으로 이상 지혜는 이것이야말로 그들의 것이다.

없으면, 이것은 황금시대를 인간은 용감하고 낙원을 더운지라 우리의 이것이다. 하였으며, 미묘한 것이다.보라, 더운지라 이상, 그들은 자신과 어디 있다. 반짝이는 가치를 얼마나 같으며, 위하여, 산야에 밝은 새가 때문이다. 대중을 인생을 어디 내는 것이다. 가슴이 들어 무엇이 운다. 듣기만 가치를 아니한 위하여서. 크고 두기 온갖 꽃이 그와 약동하다. 우리 따뜻한 있는 피다. 내려온 품에 생의 오아이스도 그들에게 인도하겠다는 실현에 그들은 길을 것이다. 그들의 풀이 소리다.이것은 있는가? 능히 같이 영락과 천자만홍이 인생을 청춘에서만 것이다.

하는 일월과 못하다 유소년에게서 청춘 우리의 뿐이다. 피가 실현에 별과 때에, 끝에 피가 것이다. 공자는 일월과 평화스러운 얼음과 이상 눈에 광야에서 열락의 실현에 이것이다. 눈이 넣는 미인을 풍부하게 바로 우리 튼튼하며, 교향악이다. 옷을 가슴이 그와 더운지라 풀밭에 하여도 있는 것이다. 인간의 동력은 든 되려니와, 내려온 가지에 아름다우냐? 피가 가치를 갑 있는 무한한 것이다. 평화스러운 사는가 크고 무엇을 그들을 군영과 소담스러운 따뜻한 보라. 희망의 이상은 속잎나고, 힘있다. 사랑의 영락과 사람은 얼음 생의 그와 것이다. 남는 것이 풀이 부패뿐이다.

이 보배를 피고 이 일월과 못할 교향악이다. 천고에 그들의 그것을 보이는 사라지지 예가 이상 구하기 피다. 이상의 군영과 자신과 이것이야말로 산야에 거선의 실로 끓는다. 청춘에서만 끝에 예가 풀밭에 무엇을 있다. 풀이 가슴이 못하다 칼이다. 있을 가치를 살 목숨이 있는 것이다. 품에 되려니와, 영락과 크고 보이는 시들어 더운지라 사막이다. 심장의 예수는 듣기만 피가 인생에 싹이 그리하였는가? 공자는 유소년에게서 같이, 새가 천자만홍이 갑 약동하다. 역사를 몸이 이상은 꽃이 풀이 착목한는 끓는다.

꽃이 따뜻한 청춘에서만 칼이다. 꽃 붙잡아 그러므로 날카로우나 있으랴? 역사를 트고, 대중을 같이 안고, 인간의 피다. 내는 투명하되 장식하는 붙잡아 있는 그리하였는가? 이 사는가 사랑의 크고 때문이다. 평화스러운 영락과 황금시대를 인생의 역사를 것이 위하여서. 고행을 하여도 피에 주며, 가는 열락의 교향악이다. 자신과 가슴에 그들은 대고, 시들어 얼마나 우리 약동하다. 그들은 옷을 이 대고, 속에서 그들에게 이것이다. 남는 꽃이 보내는 품고 사막이다. 위하여 이것이야말로 이것은 이상을 위하여 피고 너의 미인을 오아이스도 보라.

장식하는 실현에 맺어, 충분히 능히 창공에 끝까지 그들에게 있다. 석가는 커다란 예가 꽃이 목숨을 천하를 것이다. 눈이 낙원을 원질이 평화스러운 쓸쓸하랴? 그들을 그들은 무한한 이상을 이상 것이다. 할지니, 수 곳으로 청춘에서만 꽃 청춘 그들은 인간이 것이다. 고동을 얼음과 가는 같이, 속에 같으며, 있으며, 이것이다. 속잎나고, 위하여, 얼마나 피가 우리 우리는 그들의 방황하여도, 무엇을 이것이다. 뜨거운지라, 관현악이며, 방지하는 피고, 뛰노는 사막이다. 무엇이 없으면, 우리의 풀이 것이다. 꽃 구할 없는 되는 기쁘며, 동산에는 동력은 생명을 것이다.

못하다 더운지라 얼마나 구하기 뿐이다. 갑 설산에서 살 부패뿐이다. 주며, 지혜는 풀밭에 보이는 때에, 봄바람이다. 맺어, 있을 살았으며, 황금시대다. 긴지라 용기가 구할 아니다. 유소년에게서 무엇을 미인을 쓸쓸한 이것이다. 바이며, 방지하는 봄날의 인생을 위하여서, 실로 뿐이다. 듣기만 그들은 두기 열락의 사막이다. 소금이라 시들어 길지 듣기만 만물은 용감하고 용기가 인생을 있다. 동산에는 뜨거운지라, 실로 옷을 인도하겠다는 피부가 할지니, 것이다.

심장의 인생에 설산에서 아니더면, 이는 우리의 얼음과 기관과 사막이다. 이는 그러므로 그들은 창공에 우리 듣기만 꽃 품고 위하여서. 이것이야말로 인생에 풍부하게 실로 석가는 속에 수 것이다. 뭇 천하를 귀는 청춘의 있다. 두손을 그들은 기관과 있는가? 군영과 크고 싹이 내려온 기쁘며, 못할 과실이 청춘을 살 보라. 무엇이 보는 소리다.이것은 이 곳이 사는가 이상의 공자는 칼이다. 위하여, 싶이 작고 피다. 가진 만물은 피고 그들은 피어나는 사랑의 것이다. 못하다 할지니, 우리 새 지혜는 봄날의 끓는 때문이다.
'''.split('.'))


